Revit 2027 API
AnnotationSymbol.duplicate Method
Duplicate this annotation symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnnotationSymbol duplicate()
Public Function duplicate As AnnotationSymbol
public:
AnnotationSymbol^ duplicate()
member duplicate : unit -> AnnotationSymbol
Return Value
AnnotationSymbol
Pointer to the new annotation symbol.
See Also
Reference
AnnotationSymbol Class
Autodesk.Revit.DB Namespace